package com.tzg.nobugdictionary.Bean;

import java.io.Serializable;
import java.util.List;

public class PyBean {

    /**
     * reason : 返回成功
     * result : {"list":[{"id":"d3874a5d247665aa","zi":"阿","py":"a,e","wubi":"bskg","pinyin":"à,ǎ,ā,ē","bushou":"阝","bihua":"7","jijie":["阿","ā","加在称呼上的词头：阿大。阿爷。阿爹。阿罗汉。阿毛。阿婆。阿弟。阿姊。","","笔画数：7；","部首：阝；","笔顺编号：5212512",""],"xiangjie":["阿","ē","【名】","(形声。从阜,可声。本义:大的山陵,大的土山)","同本义〖bigmound〗","阿,大陵也。一曰曲阜也。\u2014\u2014《说文》","我陵我阿。\u2014\u2014《诗·大雅·皇矣》","有卷者阿。\u2014\u2014《诗·大雅·卷阿》","在彼中阿。\u2014\u2014《诗·小雅·菁菁者莪》","又如:阿丘(一边偏高的土丘)","泛指山〖mountain〗","流自眺夫衡阿兮。\u2014\u2014张衡《思玄赋》。注:\u201c山下也。\u201d","又如:阿阜(山峰,峰峦);崇阿(高大的山)","山坡〖hillside〗","细缯,古代一种轻细的丝织品〖finesilks〗","衣阿锡,曳齐纨。\u2014\u2014《淮南子·修务》","被阿锡,揄纻缟。\u2014\u2014《史记·司马相如传》","曳阿锡。\u2014\u2014《汉书·礼乐志》。注:\u201c细缯也。\u201d","又如:阿锡(细的丝布。阿指细缯,锡是细布)","曲隅,角落〖corner〗","四阿重屋。\u2014\u2014《周礼·考工记》","若有人兮山之阿。\u2014\u2014《楚辞·山鬼》。注:\u201c曲隅也。\u201d","周阿而生\u2014\u2014班固《西都赋》。注:\u201c庭之曲也。\u201d","汾之阿。\u2014\u2014《汉书·礼乐志》。注:\u201c水之曲隅。\u201d","水边〖waterside〗","丙午,天子饮于河水之阿。\u2014\u2014《穆天子传》","近旁〖nearby;near〗。如:阿门(旁门)","地名。即今山东省东阿县〖Dong'ecounty〗。如:阿缟(古代齐国东阿县所产的细缯)","","阿","ē","【动】","曲从;迎合〖panderto;playupto〗","弗谏而阿之。\u2014\u2014《国语·周语》。注:\u201c随也。\u201d","阿郑君之心。\u2014\u2014《吕氏春秋·长见》","行叩诚而不阿兮。\u2014\u2014《楚辞·逢纷》。注:\u201c曲也。\u201d","是察阿党。\u2014\u2014《礼记·月令》。注:\u201c谓治狱吏以私恩,曲桡为也。\u201d","又如:阿奉(阿谀奉承);阿世(迎合世俗);阿邑(迎合奉承的样子);阿意(曲意附和他人的心意)","偏袒〖beunfairlypartialto〗。如:阿好(偏袒自己所喜好的人或事物);阿私(偏袒;庇护);阿党(结党偏私)","[方言]∶通\u201c屙\u201d。拉,排泄大小便〖exerete〗。如:阿金溺银(指生财有道);阿绵花屎(拖延,磨时间)","另见ā;ǎ;à;a","","阿堵","ēdǔ","〖money〗俗指银钱","任是亲儿女,还随阿堵移。\u2014\u2014《二刻拍案惊奇》","阿堵物","ēdǔwù","〖money〗钱","夷甫晨起,见钱阂行,呼婢曰:\u201c举却阿堵物。\u201d\u2014\u2014《世说新语·规箴》","阿附","ēfù","〖fawnonandecho〗逢迎依附","丞相匡衡、御史大夫张谭皆阿附畏事显,不敢言。\u2014\u2014《汉书·王尊传》","阿胶","ējiāo","〖EjiaodonkeyhideglueproducedinDongexianofShandongprovince〗中药名。别名驴皮胶。为驴皮加水熬成的胶","阿弥陀佛","ēmítuófó","〖梵Amitabha〗∶佛教徒所指西方极乐世界里最大的佛,为梵语Amitabha的译音,也译作无量寿佛或无量光明佛。净土宗以阿弥陀佛为西方极乐世界的教主,认为凡愿往生极乐净土者,念阿弥陀佛的名号,临终时佛即出现,引导其进入极乐国土","〖mayBuddhapreserveus;mercifulBuddha〗∶信佛的人口头念诵的用语。表示祈祷或感谢神灵等意思","〖thankGod!〗∶感叹用语,含有\u201c还好\u201d、\u201c万幸\u201d、\u201c谢天谢地\u201d一类的意思","没有人要你劝,少给我滋些事就阿弥陀佛了!\u2014\u2014沙汀《淘金记》","〖kind〗∶慈善的,善良的","这么个威武大汉,倒有一副阿弥陀佛的性子。\u2014\u2014蒋子龙《机电局长的一天》","阿房宫","eｐáｎｇgōｎｇ","［EpangPalace］秦始皇时开始建筑的大型宫殿,规模宏大。公元前212年动工,秦亡时未完工。项羽打进咸阳后被焚毁,遗址在今西安市西阿房村","蜀山兀，阿房出。\u2014\u2014杜枚《阿房宫赋》","阿房宫，三百里，住不下金陵一个史。\u2014\u2014《红楼梦》","阿其所好","ēqísuǒhào","〖pandertosb.\u2019swhims〗迎合别人的喜爱","吾何能阿其所好为?\u2014\u2014鲁迅《坟·摩罗诗力说》","阿谀","ēyú","〖flatter;toady〗说别人爱听的话迎合奉承","吾生为袁氏臣,死为袁氏鬼。不似汝辈谄阿谀之贼。\u2014\u2014《三国演义》","阿谀曲从","老练的阿谀可以买动一个老实人","","阿","ā","【助】","(汉语名词词头,盛行于魏晋以后)","加在亲属称呼前面有亲昵的意味","阿姊闻妹来。\u2014\u2014《乐府诗集·木兰诗》","府吏得闻之,堂上启阿母。\u2014\u2014《玉台新咏·古诗为焦仲卿妻作》。　","又如:阿爷(又作\u201c阿耶\u201d。称父亲);阿翁(称祖父;称父亲;妇女称丈夫之父);阿嫂(对朋友之妻的称呼);阿叔(对丈夫之弟的称呼);阿家(又称\u201c阿姑\u201d。妇人称丈夫的母亲);阿爹(称父亲;也尊称长者);阿父(称父亲;也称伯伯、叔叔,或作伯叔自称);阿伯(尊称年长的男子)","加于某些人的姓、名、小名、排行前用作称呼,往往带有一定的感情色彩或尊卑关系","阿女含泪答。\u2014\u2014《玉台新咏·古诗为焦仲卿妻作》。","又如:阿咸(侄子。晋朝阮籍的侄儿阮咸有才,后来遂用来称侄子);阿连(弟弟。南朝宋谢灵运的族弟惠连很有才,人们随谢灵运称之为阿连);阿杜(原指周盘龙的小妾杜氏,后为妾的别称);阿娇(汉武帝陈皇后的小名;泛指美丽的女子);阿蒙(三国时吴国名将吕蒙);阿瞒(三国曹操的小字)","","阿","ā","用于外国语的音译。如:阿根廷;阿拉伯;阿波罗","阿托(10-18)的简称〖atto-〗","阿","ā","【语气】","表示疑问、肯定、呼召、祈请等语气〖sameas\u201c啊\u201d〗","是阿!我想办一桩事情,总得先立个威。\u2014\u2014《文明小史》","好苦恼阿!好苦恼阿!我出去,我出去。\u2014\u2014佚名《刘弘嫁婢》","儿阿,不是我有心要耽误你。\u2014\u2014《儒林外史》","又如:阿也(阿约,阿呀。哎哟)","另见ǎ;à;a;ē;ě","","阿爸","ābà","〖father〗爸爸","阿鼻","ābí","〖梵语Avici〗音译名。意译为\u201c无间\u201d,即痛苦无有间断之意。为佛教八大地狱中最下、最苦之处","阿波罗计划","ābōluóJìhuà","〖Apolloprogram〗美国的一项科学技术计划,包括把人送上月球并安全返回地球","阿昌族","āchāngzú","〖theAchangnationality〗居住在云南省西南部陇川、梁河和临近的潞西、龙陵等县的一个少数民族","阿的平","ādìpíng","〖atabrine〗〖药〗黄色苦味粉末,2-甲氧-6-氯-9-(α-甲基-δ-二乙基胺-丁基)-氨吖啶的二盐酸盐。曾广泛用于预防和治疗疟疾,现已被氯喹取代","阿弟","ādì","〖theyoungerbrother〗∶弟弟","〖youngman〗∶年长者对年青人的客套称呼","阿斗","ādǒu","〖Adou〗∶三国蜀汉刘备之子刘禅的小名。此人庸碌无能,虽有诸葛亮等人全力扶助,也不能振兴蜀汉","〖anignorantandincapableman;good-for-nothingfellow〗∶后指懦弱无能的人","不要把群众看作阿斗","阿飞","āfēi","〖Teddyboy;beatnik;hippie(hippy);ayouthgiventorowdybehaviourandqueerdress〗穿着奇特服装、行为轻薄的青少年流氓","阿芙蓉","āfúróng","〖opium〗鸦片,俗称大烟。见\u201c阿片\u201d","阿芙蓉,芙前代罕闻,近方有用者,云是罂粟花之津液也。又,以花色似芙蓉而得名。\u2014\u2014李时珍《本草纲目》","阿哥","āgē","〖elderbrother〗∶对兄长的称呼","〖brother〗∶对年轻男子的亲热称呼\u2014\u2014尤其是某些少数民族地区年轻未婚女子对自己异性朋友的称呼","〖son〗∶满族父母对儿子的称呼","〖youngprince〗∶清代皇室称没有成年的皇子","阿公","āgōng","[方言]","〖father-in-law〗∶丈夫的父亲","〖grandfather〗∶祖父","〖oldgentleman〗∶对老年男人的尊称","〖papa〗∶爸爸","阿公要煮咸,阿妈要煮淡","阿訇","āhōng","〖ahung;Akhun;Imam;Mulla〗主持伊斯兰教的各种仪式,讲解古兰经的人","阿拉伯胶","ālābójiāo","〖gumarabic〗一种水溶性的胶,从几种金合欢属植物(尤指Acaciasenegal阿拉伯胶树和A.arabica阿拉伯金合欢)中得到,特别用于制造粘合剂、墨水和糖果,用于纺织品的精加工和制药","阿拉伯数字","ālābóshùzì","〖Arabicnumeral(figures)〗0、1、2、3、4、5、6、7、8、9这十个数字符号,是为了计数和算术运算而采用的约定写法,是国际通用的数码,也称为阿拉伯数码","阿罗汉","āluóhàn","〖Arhat〗〖佛教用语〗∶梵语的音译,即得道者、圣者的意思。小乘佛教所理想的最高果位,佛果;也是对断绝了一切嗜好情欲、解脱了烦恼、受人崇拜敬仰的圣人的一种称呼。又叫\u201c罗汉\u201d","阿罗汉诺矩罗居震旦东南大海际雁荡山芙蓉峰龙湫。\u2014\u2014宋·沈括《梦溪笔谈》","阿妈","āmā","〖ma,mother〗∶妈妈","〖servingwoman;amah〗∶女佣人","〖wife〗∶老年男子对妻子的称呼","〖father〗∶满族人称父亲,也作\u201c啊嘛\u201d","阿妹","āmèi","〖youngersister〗妹妹","阿门","āmēn","〖amen〗亦作\u201c阿们\u201d,希伯来语〖āmēn〗的译音,意为\u201c真诚\u201d,表示\u201c诚心所愿,心愿如此,但愿如此\u201d\u2014\u2014基督教徒祈祷完毕时的用语","阿米巴痢疾","āmǐbālìji","〖amoebicdysentery〗因阿米巴(溶组织性内阿米巴Endamoebahistolytica)感染引起的人类急性肠炎,特征为频繁排出充满粘液和血的稀便、肠绞痛以及或多或少的肠壁(尤其是结肠)糜烂","阿木林","āmùlín","〖dullfellow〗[方言]∶呆子;傻瓜","阿奶","ā\u2019nǎi","〖granny〗[方言]","奶奶","对年老妇女的通称","阿片","āpiàn","〖opium〗一种乳状液体,取自尚未成熟的罂粟果,干燥后呈淡黄色或棕色,味苦。有止泻、镇痛和止咳作用。又叫大烟、鸦片(雅片)或阿芙蓉","阿婆","āpó","〖grandmother〗∶祖母。敬称老年妇人","〖mother-in-law〗∶称丈夫的母亲","阿Ｑ","ā-Q","〖Ah-Q〗鲁迅小说《阿Q正传》中的主人公,精神胜利者的典型","阿司匹林","āsīpǐlín","〖aspirin〗一种白色结晶状的水杨酸化合物CH3COOC6H4COOH,主要用于解热镇痛","阿嚏","ātì","〖achi;sneeze〗象声词,打喷嚏的声音","阿托品","ātuōpǐn","〖atropine〗从颠茄和其他茄科植物提取出的一种有毒的白色结晶状生物碱C17H23NO3,主要用其硫酸盐解除痉挛,减少分泌,缓解疼痛,散大瞳孔","阿物儿","āwùr","〖something〗东西,常用做蔑称或对人开玩笑的称呼","你是什么阿物儿,跑来胡闹。\u2014\u2014《红楼梦》","阿兄","āxiōng","〖theelderbrother〗哥哥","阿姨","āyí","〖aunt〗[方言]∶母亲的姊妹","〖stepmother〗∶继母","〖auntie〗∶晚辈对任何女性长辈的亲切称呼","弟走从军阿姨死。\u2014\u2014白居易《琵琶行(并序)》","〖nurse〗∶照顾孩子的保姆","","阿","ǎ","【叹】","用于表示各种感情(如惊讶)〖ah〗","阿,你怎的这样客气起来!\u2014\u2014鲁迅《呐喊·故乡》","另见ā;à;a;ē;ě","","阿","à","【副】","[方言]∶可,是否〖may;can;whetherornot〗。用在问句中,加强语气。如:阿晓得(可晓得)?阿去(可去)?"]},{"id":"13db3d41d0e3d116","zi":"吖","py":"a,ya","wubi":"kuhh","pinyin":"ā,yā","bushou":"口","bihua":"6","jijie":["吖","yā","喊：叫天吖地。","形容喊叫的声音：高声叫吖吖。","","吖","ā","叹词，相当于\u201c呵\u201d。","","笔画数：6；","部首：口；","笔顺编号：251432",""],"xiangjie":["吖","yā","【动】","喊,呼喊〖cry〗","不索你没来由这般叫天吖地。\u2014\u2014高文秀《黑旋风》","","吖","yā","【象】","喊声","则听得巡院家高声的叫吖吖。\u2014\u2014张国宾《合汗衫》","另见ā","","吖","ā","\u2014\u2014外国语的音译,主要用于有机化学。如:吖嗪","","吖啶","ādìng","〖acridine〗一种无色晶状微碱性三环化合物C13H9N,存在于煤焦油的粗蒽馏分中,是制造染料和药物(如吖啶黄素和奎吖因)的重要母体化合物"]},{"id":"07dfe9d9e9020f5d","zi":"呵","py":"a,a,ha,he,ke","wubi":"kskg","pinyin":"ā,ɑ,hā,hē,kē","bushou":"口","bihua":"8","jijie":["呵","hē","怒责：呵责。呵斥（亦作\u201c呵叱\u201d）。呵禁。","吁气：呵冻（哈气使暧）。一气呵成。","象声词，形容笑：呵呵。","叹词，表示惊讶：呵，真不得了！","","呵","ɑ","同\u201c啊5\u201d。","","呵","kē","〔呵叻〕地名，在泰国。","","笔画数：8；","部首：口；","笔顺编号：25112512",""],"xiangjie":["呵","hā","【动】","弯〖下〗〖bend;stoop〗","他很大方地呵一呵腰,就走出去了。\u2014\u2014茅盾《子夜》","另见ā;a;hē;kē","","呵","訶","hē","【动】","(形声。从口,可声。本义:怒责,大声发怒地喝斥)","同本义〖abuse;berate〗","訶,大言而怒也。从言,可声,字亦作呵。\u2014\u2014《说文》","訶,怒也。\u2014\u2014《广雅·释诂二》","纵而弗呵虖。\u2014\u2014《汉书·食货志》。注:\u201c责怒也。\u201d","青邶之山有鸟焉,其音若呵。\u2014\u2014《山海经·南山经》","呵,责也。\u2014\u2014《玉篇》","王出而訶之。\u2014\u2014《韩非子·内储说下》","厉声以呵。\u2014\u2014明·张溥《五人墓碑记》","又如:呵咄(大声斥责;吆喝);呵怒(怒斥);呵格(喝斥殴打);呵索(呵叱搜查);呵辱(辱骂);呵逐(斥骂驱逐);呵问(责问;盘究)","喝道,喝令行人让路〖hoot〗","武夫前呵,从者塞途。\u2014\u2014韩愈《送李愿归盘谷序》","又如:呵引(呵道);呵卫(喝道护卫的人);呵道(亦作\u201c呵导\u201d。古时贵人外出时,引路差役喝令行人让路)","呼叫〖yell〗。如:呵噪(众声呼叫);呵吓(喧哗)","嘘气;哈气〖breatheoutwiththemouthopen〗。如:呵手(向手嘘气使暖);呵冻(冬天手指冻僵或笔砚成冰,呵气使温暖或融解);呵砚(天寒嘘气使砚中墨汁解冻)","喝〖drink〗","次日早辰,小鸦儿吃了几个冷饼,呵了两碗热水,依旧挑了担子出去。\u2014\u2014《醒世姻缘传》","你不吃,呵嗏儿罢。\u2014\u2014《金瓶梅词话》","","呵","嗬","hē","【叹】","表示惊讶〖aha〗。如:呵,这小伙子真棒!呵会(幸会)","呵","hē","【象】","笑声〖laugh〗","有酒且呵呵,人生能几何?\u2014\u2014韦庄《菩萨蛮》词","又如:呵呵(笑声);呵呵大笑","另见ā;a;hā;kē","","呵斥","hēchì","〖bawlout;berate〗∶大声或粗暴地责骂","一个高个子红头发工头,他的主要德行是呵斥工人","〖excoriate〗∶严厉指责","呵呵","hēhē","〖roarwithlaughter〗象声词,笑声","呵喝","hēhè","〖shoutloudly〗发怒而大声喝斥","呵禁","hējìn","〖berate〗大声喝斥制止","呵欠","hēqiàn","〖yawn〗困倦时往往情不自禁地张开大口吸气的现象","深深打了个呵欠","呵责","hēzé","〖abuse;berate;excoriate〗大声斥责","","呵","kē","\u2014\u2014译音用字。如:呵罗单,古国名,故地在今苏门答腊岛","另见hē","","呵","ā","【叹】","表示惊异或赞叹。同\u201c啊\u201d〖ah〗","呵,青春,愿你光芒四射。\u2014\u2014郭小川《致青年公民》","另见a;hā;hē;kē","","呵","a","【助】","表示感叹或惊讶的语气〖ah〗","安家立业了,日子过好了,可是不能忘本呵。\u2014\u2014周立波《暴风骤雨》","另见ā;hā;hē;kē"]},{"id":"36bc3372d9b9fec7","zi":"啊","py":"a","wubi":"kbsk","pinyin":"á,à,ǎ,ā,ɑ","bushou":"口","bihua":"10","jijie":["啊","ā","叹词，表示赞叹或惊异：啊，这花真美呀！啊哈。啊呀。","","啊","á","　ㄚˊ","叹词，表示疑问或反问：啊，你说什么？","","啊","ǎ","　ㄚˇ","叹词，表示疑惑：啊，这是怎么回事？","","啊","à","　ㄚˋ","叹词，表示应诺（音较短）：啊，好吧！","叹词，表示醒悟（音较长）：啊，我这才明白过来！","表示赞叹（音较长）：啊，亲爱的祖国！","","啊","ɑ","　ㄚ","助词，在句末，表示惊叹的语气（常因前面字音不同而发生变音，可用不同的字来表示）：你好啊（哇）！真新鲜啊（哪）！","","笔画数：10；","部首：口；","笔顺编号：2515212512",""],"xiangjie":["啊","ā","【叹】","(形声。从口,阿声。本义:叹词)表示惊叹或赞颂〖ah〗。如:啊!多么美丽的夜色;啊!祖国,我为您歌唱","另见á;ǎ;à;a","","啊哈","āhā","〖oh;ah;well〗表示语气的叹词","表示惊喜","啊哈,我看见他了","表示恍然大悟","啊哈,我明白了","表示满意","啊哈,总算干得还不赖","啊呀","āyā","叹词","〖oh〗∶表示惊讶","啊呀,他跑得真快呀","〖why〗∶表示不满,为难","啊呀,怎么弄了满地的水","啊呀,这事不好办哪","啊哟","āyō","〖ayo〗叹词,表示情绪激动或惊讶","啊哟,吓死我了","啊唷","āyō","同\u201c啊哟\u201d","","啊","á","【叹】","表示追问或要求再说一遍〖ah〗。如:啊?你说谁?你想过这些事没有?啊!","另见ā;ǎ;à;a","","啊","ǎ","【叹】","表示惊疑或疑惑〖ah〗。如:啊?这是怎么回事;他说我还小,啊?我不小了吧;啊?可以这样说吗?","另见ā;á;à;a","","啊","à","【叹】","表示应诺等的叹词〖ah〗","表示应诺。如:啊,我就去;啊,好吧","表示醒悟。如:啊,对啦!对啦;啊,原来是他,怪不得看着挺面熟","表示惊异或赞叹。如:啊!黄河,你是我们民族的摇篮","用来表示悲痛、遗憾或忧伤〖woe〗","另见ā;á;ǎ;a","","啊","阿","a","【助】","表示语气〖what〗","用在感叹句末,加强感叹语气。如:他跑得真快啊","用在陈述句或祈使句,表示肯定、辨明、请求、劝止、警告、催促、命令等。如:这话说得对啊!请坐啊,女士们","用在问句末尾〖really?〗","在有疑问指代词的问句或选择问句里,用来和缓语气。如:是谁啊?","在陈述句形式的问句里,提问的目的是要求得到证实。如:你不去啊?","用在打招呼的话里〖hay〗。如:老张啊,你这儿来!","用在重复的动词后面,表示过程长〖onandon〗。如:\u2026找啊找啊,终于找到了金矿","另见ā;á;ǎ;à;","\u201c阿\u201d另见ā;ǎ;à;ē"]},{"id":"50c3c31ebc297ff2","zi":"嗄","py":"a,sha","wubi":"kdht","pinyin":"á,shà","bushou":"口","bihua":"13","jijie":["嗄","shà","嗓音嘶哑。","","嗄","á","同\u201c啊2\u201d。","","笔画数：13；","部首：口；","笔顺编号：2511325111354",""],"xiangjie":["嗄","shà","【形】","声音嘶哑的〖hoarse〗","终日嚎而嗌不嗄。\u2014\u2014《老子》","又如:嗄哑,嗄嘶(嗓音嘶哑)","","嗄","shà","【叹】","什么〖what〗\u2014\u2014表示否定","我要丢个干干净,看你嗄法把我治。\u2014\u2014清·蒲松龄《聊斋俚曲集》","旧时仆役对主人、下级对上级的应诺声〖yes〗","\u201c带进来\u201d。两边军士应一声\u201c嗄\u201d,即将牛皋推至面前。\u2014\u2014《说岳全传》","另见á","","嗄","á","【叹】","同\u201c啊\u201d(á)。表示省悟或惊奇〖ah〗","嗄!难道这里是没有地方官的么?\u2014\u2014宋·佚名《新编五代史平话》","另见shà"]},{"id":"71f5862af09e60aa","zi":"腌","py":"a,yan","wubi":"edjn","pinyin":"ā,yān","bushou":"月","bihua":"12","jijie":["腌","yān","用盐浸渍食物：腌肉。腌菜。腌制。腌渍。","","笔画数：12；","部首：月；","笔顺编号：351113425115",""],"xiangjie":["腌","醃","yān","【动】","(形声。从肉,奄声。本义:用盐浸渍食物)","同本义〖salt〗","腌,渍肉也。\u2014\u2014《说文》","腌,酢,淹肉也。字亦作醃。\u2014\u2014《苍颉篇》","又如:腌腊肉;腌陈(盐渍久贮的食物);腌肉(指用盐浸渍肉块);腌胙(盐腌的胙肉);腌造(用盐或酱等浸渍加工鱼肉蔬菜瓜果等);腌菜(用盐浸渍的蔬菜);腌藏(腌渍储藏);腌腊(把鱼、肉等用盐浸渍,然后风干、熏干。亦指腌制后风干的鱼、肉、鸡、鸭等)","变咪〖gobad〗","兄长,已定这鱼腌了,不中仁兄吃。\u2014\u2014《水浒传》","另见ā","","腌货","yānhuò","〖preserveinsalt;pickledvegetable;saltedmeat〗用盐、糖、酱、酒等浸渍加工制成的咸肉、酱菜等","腌制","yānzhì","〖preserveinsalt〗用糖、盐等浸渍的方法制","腌制泡菜","腌渍","yānzì","〖pickle;salt〗腌","腌渍蔬菜","","腌","ā","另见yān","","腌臜","āzā","〖dirty〗[方言]∶脏的,不干净的","〖clumsy〗∶〖心里〗别扭;不痛快","晚到一步,事没办成,腌臜极了","〖nauseating〗∶骂人的话,混蛋无赖","腌臜泼才","",""]},{"id":"cf5f5aeed0a95c36","zi":"锕","py":"a","wubi":"qbsk","pinyin":"ā","bushou":"钅","bihua":"12","jijie":["锕","（錒）","ā","一种放射性元素，由铀衰变而成。","Acactinium","","笔画数：12；","部首：钅；","笔顺编号：311155212512",""],"xiangjie":["锕","錒","ā","【名】","一种放射性的三价金属元素,原子序数89,其化学性质类似于镧,由镤经放射α粒子生成,半衰期为22年,尤见于沥青铀矿中〖actinium〗\u2014\u2014元素符号Ac","",""]},{"id":"065f42a0e92d8b17","zi":"錒","py":"a","wubi":"","pinyin":"ā","bushou":"釒","bihua":"15","jijie":["錒","ā","见\u201c锕\u201d。","","笔画数：15；","部首：釒；","笔顺编号：341124315212512"],"xiangjie":[""]}],"page":1,"pagesize":10,"totalpage":1,"totalcount":8}
     * error_code : 0
     */

    private String reason;
    private ResultBean result;
    private int error_code;

    public String getReason() {
        return reason;
    }

    public void setReason(String reason) {
        this.reason = reason;
    }

    public ResultBean getResult() {
        return result;
    }

    public void setResult(ResultBean result) {
        this.result = result;
    }

    public int getError_code() {
        return error_code;
    }

    public void setError_code(int error_code) {
        this.error_code = error_code;
    }

    public static class ResultBean{
        /**
         * list : [{"id":"d3874a5d247665aa","zi":"阿","py":"a,e","wubi":"bskg","pinyin":"à,ǎ,ā,ē","bushou":"阝","bihua":"7","jijie":["阿","ā","加在称呼上的词头：阿大。阿爷。阿爹。阿罗汉。阿毛。阿婆。阿弟。阿姊。","","笔画数：7；","部首：阝；","笔顺编号：5212512",""],"xiangjie":["阿","ē","【名】","(形声。从阜,可声。本义:大的山陵,大的土山)","同本义〖bigmound〗","阿,大陵也。一曰曲阜也。\u2014\u2014《说文》","我陵我阿。\u2014\u2014《诗·大雅·皇矣》","有卷者阿。\u2014\u2014《诗·大雅·卷阿》","在彼中阿。\u2014\u2014《诗·小雅·菁菁者莪》","又如:阿丘(一边偏高的土丘)","泛指山〖mountain〗","流自眺夫衡阿兮。\u2014\u2014张衡《思玄赋》。注:\u201c山下也。\u201d","又如:阿阜(山峰,峰峦);崇阿(高大的山)","山坡〖hillside〗","细缯,古代一种轻细的丝织品〖finesilks〗","衣阿锡,曳齐纨。\u2014\u2014《淮南子·修务》","被阿锡,揄纻缟。\u2014\u2014《史记·司马相如传》","曳阿锡。\u2014\u2014《汉书·礼乐志》。注:\u201c细缯也。\u201d","又如:阿锡(细的丝布。阿指细缯,锡是细布)","曲隅,角落〖corner〗","四阿重屋。\u2014\u2014《周礼·考工记》","若有人兮山之阿。\u2014\u2014《楚辞·山鬼》。注:\u201c曲隅也。\u201d","周阿而生\u2014\u2014班固《西都赋》。注:\u201c庭之曲也。\u201d","汾之阿。\u2014\u2014《汉书·礼乐志》。注:\u201c水之曲隅。\u201d","水边〖waterside〗","丙午,天子饮于河水之阿。\u2014\u2014《穆天子传》","近旁〖nearby;near〗。如:阿门(旁门)","地名。即今山东省东阿县〖Dong'ecounty〗。如:阿缟(古代齐国东阿县所产的细缯)","","阿","ē","【动】","曲从;迎合〖panderto;playupto〗","弗谏而阿之。\u2014\u2014《国语·周语》。注:\u201c随也。\u201d","阿郑君之心。\u2014\u2014《吕氏春秋·长见》","行叩诚而不阿兮。\u2014\u2014《楚辞·逢纷》。注:\u201c曲也。\u201d","是察阿党。\u2014\u2014《礼记·月令》。注:\u201c谓治狱吏以私恩,曲桡为也。\u201d","又如:阿奉(阿谀奉承);阿世(迎合世俗);阿邑(迎合奉承的样子);阿意(曲意附和他人的心意)","偏袒〖beunfairlypartialto〗。如:阿好(偏袒自己所喜好的人或事物);阿私(偏袒;庇护);阿党(结党偏私)","[方言]∶通\u201c屙\u201d。拉,排泄大小便〖exerete〗。如:阿金溺银(指生财有道);阿绵花屎(拖延,磨时间)","另见ā;ǎ;à;a","","阿堵","ēdǔ","〖money〗俗指银钱","任是亲儿女,还随阿堵移。\u2014\u2014《二刻拍案惊奇》","阿堵物","ēdǔwù","〖money〗钱","夷甫晨起,见钱阂行,呼婢曰:\u201c举却阿堵物。\u201d\u2014\u2014《世说新语·规箴》","阿附","ēfù","〖fawnonandecho〗逢迎依附","丞相匡衡、御史大夫张谭皆阿附畏事显,不敢言。\u2014\u2014《汉书·王尊传》","阿胶","ējiāo","〖EjiaodonkeyhideglueproducedinDongexianofShandongprovince〗中药名。别名驴皮胶。为驴皮加水熬成的胶","阿弥陀佛","ēmítuófó","〖梵Amitabha〗∶佛教徒所指西方极乐世界里最大的佛,为梵语Amitabha的译音,也译作无量寿佛或无量光明佛。净土宗以阿弥陀佛为西方极乐世界的教主,认为凡愿往生极乐净土者,念阿弥陀佛的名号,临终时佛即出现,引导其进入极乐国土","〖mayBuddhapreserveus;mercifulBuddha〗∶信佛的人口头念诵的用语。表示祈祷或感谢神灵等意思","〖thankGod!〗∶感叹用语,含有\u201c还好\u201d、\u201c万幸\u201d、\u201c谢天谢地\u201d一类的意思","没有人要你劝,少给我滋些事就阿弥陀佛了!\u2014\u2014沙汀《淘金记》","〖kind〗∶慈善的,善良的","这么个威武大汉,倒有一副阿弥陀佛的性子。\u2014\u2014蒋子龙《机电局长的一天》","阿房宫","eｐáｎｇgōｎｇ","［EpangPalace］秦始皇时开始建筑的大型宫殿,规模宏大。公元前212年动工,秦亡时未完工。项羽打进咸阳后被焚毁,遗址在今西安市西阿房村","蜀山兀，阿房出。\u2014\u2014杜枚《阿房宫赋》","阿房宫，三百里，住不下金陵一个史。\u2014\u2014《红楼梦》","阿其所好","ēqísuǒhào","〖pandertosb.\u2019swhims〗迎合别人的喜爱","吾何能阿其所好为?\u2014\u2014鲁迅《坟·摩罗诗力说》","阿谀","ēyú","〖flatter;toady〗说别人爱听的话迎合奉承","吾生为袁氏臣,死为袁氏鬼。不似汝辈谄阿谀之贼。\u2014\u2014《三国演义》","阿谀曲从","老练的阿谀可以买动一个老实人","","阿","ā","【助】","(汉语名词词头,盛行于魏晋以后)","加在亲属称呼前面有亲昵的意味","阿姊闻妹来。\u2014\u2014《乐府诗集·木兰诗》","府吏得闻之,堂上启阿母。\u2014\u2014《玉台新咏·古诗为焦仲卿妻作》。　","又如:阿爷(又作\u201c阿耶\u201d。称父亲);阿翁(称祖父;称父亲;妇女称丈夫之父);阿嫂(对朋友之妻的称呼);阿叔(对丈夫之弟的称呼);阿家(又称\u201c阿姑\u201d。妇人称丈夫的母亲);阿爹(称父亲;也尊称长者);阿父(称父亲;也称伯伯、叔叔,或作伯叔自称);阿伯(尊称年长的男子)","加于某些人的姓、名、小名、排行前用作称呼,往往带有一定的感情色彩或尊卑关系","阿女含泪答。\u2014\u2014《玉台新咏·古诗为焦仲卿妻作》。","又如:阿咸(侄子。晋朝阮籍的侄儿阮咸有才,后来遂用来称侄子);阿连(弟弟。南朝宋谢灵运的族弟惠连很有才,人们随谢灵运称之为阿连);阿杜(原指周盘龙的小妾杜氏,后为妾的别称);阿娇(汉武帝陈皇后的小名;泛指美丽的女子);阿蒙(三国时吴国名将吕蒙);阿瞒(三国曹操的小字)","","阿","ā","用于外国语的音译。如:阿根廷;阿拉伯;阿波罗","阿托(10-18)的简称〖atto-〗","阿","ā","【语气】","表示疑问、肯定、呼召、祈请等语气〖sameas\u201c啊\u201d〗","是阿!我想办一桩事情,总得先立个威。\u2014\u2014《文明小史》","好苦恼阿!好苦恼阿!我出去,我出去。\u2014\u2014佚名《刘弘嫁婢》","儿阿,不是我有心要耽误你。\u2014\u2014《儒林外史》","又如:阿也(阿约,阿呀。哎哟)","另见ǎ;à;a;ē;ě","","阿爸","ābà","〖father〗爸爸","阿鼻","ābí","〖梵语Avici〗音译名。意译为\u201c无间\u201d,即痛苦无有间断之意。为佛教八大地狱中最下、最苦之处","阿波罗计划","ābōluóJìhuà","〖Apolloprogram〗美国的一项科学技术计划,包括把人送上月球并安全返回地球","阿昌族","āchāngzú","〖theAchangnationality〗居住在云南省西南部陇川、梁河和临近的潞西、龙陵等县的一个少数民族","阿的平","ādìpíng","〖atabrine〗〖药〗黄色苦味粉末,2-甲氧-6-氯-9-(α-甲基-δ-二乙基胺-丁基)-氨吖啶的二盐酸盐。曾广泛用于预防和治疗疟疾,现已被氯喹取代","阿弟","ādì","〖theyoungerbrother〗∶弟弟","〖youngman〗∶年长者对年青人的客套称呼","阿斗","ādǒu","〖Adou〗∶三国蜀汉刘备之子刘禅的小名。此人庸碌无能,虽有诸葛亮等人全力扶助,也不能振兴蜀汉","〖anignorantandincapableman;good-for-nothingfellow〗∶后指懦弱无能的人","不要把群众看作阿斗","阿飞","āfēi","〖Teddyboy;beatnik;hippie(hippy);ayouthgiventorowdybehaviourandqueerdress〗穿着奇特服装、行为轻薄的青少年流氓","阿芙蓉","āfúróng","〖opium〗鸦片,俗称大烟。见\u201c阿片\u201d","阿芙蓉,芙前代罕闻,近方有用者,云是罂粟花之津液也。又,以花色似芙蓉而得名。\u2014\u2014李时珍《本草纲目》","阿哥","āgē","〖elderbrother〗∶对兄长的称呼","〖brother〗∶对年轻男子的亲热称呼\u2014\u2014尤其是某些少数民族地区年轻未婚女子对自己异性朋友的称呼","〖son〗∶满族父母对儿子的称呼","〖youngprince〗∶清代皇室称没有成年的皇子","阿公","āgōng","[方言]","〖father-in-law〗∶丈夫的父亲","〖grandfather〗∶祖父","〖oldgentleman〗∶对老年男人的尊称","〖papa〗∶爸爸","阿公要煮咸,阿妈要煮淡","阿訇","āhōng","〖ahung;Akhun;Imam;Mulla〗主持伊斯兰教的各种仪式,讲解古兰经的人","阿拉伯胶","ālābójiāo","〖gumarabic〗一种水溶性的胶,从几种金合欢属植物(尤指Acaciasenegal阿拉伯胶树和A.arabica阿拉伯金合欢)中得到,特别用于制造粘合剂、墨水和糖果,用于纺织品的精加工和制药","阿拉伯数字","ālābóshùzì","〖Arabicnumeral(figures)〗0、1、2、3、4、5、6、7、8、9这十个数字符号,是为了计数和算术运算而采用的约定写法,是国际通用的数码,也称为阿拉伯数码","阿罗汉","āluóhàn","〖Arhat〗〖佛教用语〗∶梵语的音译,即得道者、圣者的意思。小乘佛教所理想的最高果位,佛果;也是对断绝了一切嗜好情欲、解脱了烦恼、受人崇拜敬仰的圣人的一种称呼。又叫\u201c罗汉\u201d","阿罗汉诺矩罗居震旦东南大海际雁荡山芙蓉峰龙湫。\u2014\u2014宋·沈括《梦溪笔谈》","阿妈","āmā","〖ma,mother〗∶妈妈","〖servingwoman;amah〗∶女佣人","〖wife〗∶老年男子对妻子的称呼","〖father〗∶满族人称父亲,也作\u201c啊嘛\u201d","阿妹","āmèi","〖youngersister〗妹妹","阿门","āmēn","〖amen〗亦作\u201c阿们\u201d,希伯来语〖āmēn〗的译音,意为\u201c真诚\u201d,表示\u201c诚心所愿,心愿如此,但愿如此\u201d\u2014\u2014基督教徒祈祷完毕时的用语","阿米巴痢疾","āmǐbālìji","〖amoebicdysentery〗因阿米巴(溶组织性内阿米巴Endamoebahistolytica)感染引起的人类急性肠炎,特征为频繁排出充满粘液和血的稀便、肠绞痛以及或多或少的肠壁(尤其是结肠)糜烂","阿木林","āmùlín","〖dullfellow〗[方言]∶呆子;傻瓜","阿奶","ā\u2019nǎi","〖granny〗[方言]","奶奶","对年老妇女的通称","阿片","āpiàn","〖opium〗一种乳状液体,取自尚未成熟的罂粟果,干燥后呈淡黄色或棕色,味苦。有止泻、镇痛和止咳作用。又叫大烟、鸦片(雅片)或阿芙蓉","阿婆","āpó","〖grandmother〗∶祖母。敬称老年妇人","〖mother-in-law〗∶称丈夫的母亲","阿Ｑ","ā-Q","〖Ah-Q〗鲁迅小说《阿Q正传》中的主人公,精神胜利者的典型","阿司匹林","āsīpǐlín","〖aspirin〗一种白色结晶状的水杨酸化合物CH3COOC6H4COOH,主要用于解热镇痛","阿嚏","ātì","〖achi;sneeze〗象声词,打喷嚏的声音","阿托品","ātuōpǐn","〖atropine〗从颠茄和其他茄科植物提取出的一种有毒的白色结晶状生物碱C17H23NO3,主要用其硫酸盐解除痉挛,减少分泌,缓解疼痛,散大瞳孔","阿物儿","āwùr","〖something〗东西,常用做蔑称或对人开玩笑的称呼","你是什么阿物儿,跑来胡闹。\u2014\u2014《红楼梦》","阿兄","āxiōng","〖theelderbrother〗哥哥","阿姨","āyí","〖aunt〗[方言]∶母亲的姊妹","〖stepmother〗∶继母","〖auntie〗∶晚辈对任何女性长辈的亲切称呼","弟走从军阿姨死。\u2014\u2014白居易《琵琶行(并序)》","〖nurse〗∶照顾孩子的保姆","","阿","ǎ","【叹】","用于表示各种感情(如惊讶)〖ah〗","阿,你怎的这样客气起来!\u2014\u2014鲁迅《呐喊·故乡》","另见ā;à;a;ē;ě","","阿","à","【副】","[方言]∶可,是否〖may;can;whetherornot〗。用在问句中,加强语气。如:阿晓得(可晓得)?阿去(可去)?"]},{"id":"13db3d41d0e3d116","zi":"吖","py":"a,ya","wubi":"kuhh","pinyin":"ā,yā","bushou":"口","bihua":"6","jijie":["吖","yā","喊：叫天吖地。","形容喊叫的声音：高声叫吖吖。","","吖","ā","叹词，相当于\u201c呵\u201d。","","笔画数：6；","部首：口；","笔顺编号：251432",""],"xiangjie":["吖","yā","【动】","喊,呼喊〖cry〗","不索你没来由这般叫天吖地。\u2014\u2014高文秀《黑旋风》","","吖","yā","【象】","喊声","则听得巡院家高声的叫吖吖。\u2014\u2014张国宾《合汗衫》","另见ā","","吖","ā","\u2014\u2014外国语的音译,主要用于有机化学。如:吖嗪","","吖啶","ādìng","〖acridine〗一种无色晶状微碱性三环化合物C13H9N,存在于煤焦油的粗蒽馏分中,是制造染料和药物(如吖啶黄素和奎吖因)的重要母体化合物"]},{"id":"07dfe9d9e9020f5d","zi":"呵","py":"a,a,ha,he,ke","wubi":"kskg","pinyin":"ā,ɑ,hā,hē,kē","bushou":"口","bihua":"8","jijie":["呵","hē","怒责：呵责。呵斥（亦作\u201c呵叱\u201d）。呵禁。","吁气：呵冻（哈气使暧）。一气呵成。","象声词，形容笑：呵呵。","叹词，表示惊讶：呵，真不得了！","","呵","ɑ","同\u201c啊5\u201d。","","呵","kē","〔呵叻〕地名，在泰国。","","笔画数：8；","部首：口；","笔顺编号：25112512",""],"xiangjie":["呵","hā","【动】","弯〖下〗〖bend;stoop〗","他很大方地呵一呵腰,就走出去了。\u2014\u2014茅盾《子夜》","另见ā;a;hē;kē","","呵","訶","hē","【动】","(形声。从口,可声。本义:怒责,大声发怒地喝斥)","同本义〖abuse;berate〗","訶,大言而怒也。从言,可声,字亦作呵。\u2014\u2014《说文》","訶,怒也。\u2014\u2014《广雅·释诂二》","纵而弗呵虖。\u2014\u2014《汉书·食货志》。注:\u201c责怒也。\u201d","青邶之山有鸟焉,其音若呵。\u2014\u2014《山海经·南山经》","呵,责也。\u2014\u2014《玉篇》","王出而訶之。\u2014\u2014《韩非子·内储说下》","厉声以呵。\u2014\u2014明·张溥《五人墓碑记》","又如:呵咄(大声斥责;吆喝);呵怒(怒斥);呵格(喝斥殴打);呵索(呵叱搜查);呵辱(辱骂);呵逐(斥骂驱逐);呵问(责问;盘究)","喝道,喝令行人让路〖hoot〗","武夫前呵,从者塞途。\u2014\u2014韩愈《送李愿归盘谷序》","又如:呵引(呵道);呵卫(喝道护卫的人);呵道(亦作\u201c呵导\u201d。古时贵人外出时,引路差役喝令行人让路)","呼叫〖yell〗。如:呵噪(众声呼叫);呵吓(喧哗)","嘘气;哈气〖breatheoutwiththemouthopen〗。如:呵手(向手嘘气使暖);呵冻(冬天手指冻僵或笔砚成冰,呵气使温暖或融解);呵砚(天寒嘘气使砚中墨汁解冻)","喝〖drink〗","次日早辰,小鸦儿吃了几个冷饼,呵了两碗热水,依旧挑了担子出去。\u2014\u2014《醒世姻缘传》","你不吃,呵嗏儿罢。\u2014\u2014《金瓶梅词话》","","呵","嗬","hē","【叹】","表示惊讶〖aha〗。如:呵,这小伙子真棒!呵会(幸会)","呵","hē","【象】","笑声〖laugh〗","有酒且呵呵,人生能几何?\u2014\u2014韦庄《菩萨蛮》词","又如:呵呵(笑声);呵呵大笑","另见ā;a;hā;kē","","呵斥","hēchì","〖bawlout;berate〗∶大声或粗暴地责骂","一个高个子红头发工头,他的主要德行是呵斥工人","〖excoriate〗∶严厉指责","呵呵","hēhē","〖roarwithlaughter〗象声词,笑声","呵喝","hēhè","〖shoutloudly〗发怒而大声喝斥","呵禁","hējìn","〖berate〗大声喝斥制止","呵欠","hēqiàn","〖yawn〗困倦时往往情不自禁地张开大口吸气的现象","深深打了个呵欠","呵责","hēzé","〖abuse;berate;excoriate〗大声斥责","","呵","kē","\u2014\u2014译音用字。如:呵罗单,古国名,故地在今苏门答腊岛","另见hē","","呵","ā","【叹】","表示惊异或赞叹。同\u201c啊\u201d〖ah〗","呵,青春,愿你光芒四射。\u2014\u2014郭小川《致青年公民》","另见a;hā;hē;kē","","呵","a","【助】","表示感叹或惊讶的语气〖ah〗","安家立业了,日子过好了,可是不能忘本呵。\u2014\u2014周立波《暴风骤雨》","另见ā;hā;hē;kē"]},{"id":"36bc3372d9b9fec7","zi":"啊","py":"a","wubi":"kbsk","pinyin":"á,à,ǎ,ā,ɑ","bushou":"口","bihua":"10","jijie":["啊","ā","叹词，表示赞叹或惊异：啊，这花真美呀！啊哈。啊呀。","","啊","á","　ㄚˊ","叹词，表示疑问或反问：啊，你说什么？","","啊","ǎ","　ㄚˇ","叹词，表示疑惑：啊，这是怎么回事？","","啊","à","　ㄚˋ","叹词，表示应诺（音较短）：啊，好吧！","叹词，表示醒悟（音较长）：啊，我这才明白过来！","表示赞叹（音较长）：啊，亲爱的祖国！","","啊","ɑ","　ㄚ","助词，在句末，表示惊叹的语气（常因前面字音不同而发生变音，可用不同的字来表示）：你好啊（哇）！真新鲜啊（哪）！","","笔画数：10；","部首：口；","笔顺编号：2515212512",""],"xiangjie":["啊","ā","【叹】","(形声。从口,阿声。本义:叹词)表示惊叹或赞颂〖ah〗。如:啊!多么美丽的夜色;啊!祖国,我为您歌唱","另见á;ǎ;à;a","","啊哈","āhā","〖oh;ah;well〗表示语气的叹词","表示惊喜","啊哈,我看见他了","表示恍然大悟","啊哈,我明白了","表示满意","啊哈,总算干得还不赖","啊呀","āyā","叹词","〖oh〗∶表示惊讶","啊呀,他跑得真快呀","〖why〗∶表示不满,为难","啊呀,怎么弄了满地的水","啊呀,这事不好办哪","啊哟","āyō","〖ayo〗叹词,表示情绪激动或惊讶","啊哟,吓死我了","啊唷","āyō","同\u201c啊哟\u201d","","啊","á","【叹】","表示追问或要求再说一遍〖ah〗。如:啊?你说谁?你想过这些事没有?啊!","另见ā;ǎ;à;a","","啊","ǎ","【叹】","表示惊疑或疑惑〖ah〗。如:啊?这是怎么回事;他说我还小,啊?我不小了吧;啊?可以这样说吗?","另见ā;á;à;a","","啊","à","【叹】","表示应诺等的叹词〖ah〗","表示应诺。如:啊,我就去;啊,好吧","表示醒悟。如:啊,对啦!对啦;啊,原来是他,怪不得看着挺面熟","表示惊异或赞叹。如:啊!黄河,你是我们民族的摇篮","用来表示悲痛、遗憾或忧伤〖woe〗","另见ā;á;ǎ;a","","啊","阿","a","【助】","表示语气〖what〗","用在感叹句末,加强感叹语气。如:他跑得真快啊","用在陈述句或祈使句,表示肯定、辨明、请求、劝止、警告、催促、命令等。如:这话说得对啊!请坐啊,女士们","用在问句末尾〖really?〗","在有疑问指代词的问句或选择问句里,用来和缓语气。如:是谁啊?","在陈述句形式的问句里,提问的目的是要求得到证实。如:你不去啊?","用在打招呼的话里〖hay〗。如:老张啊,你这儿来!","用在重复的动词后面,表示过程长〖onandon〗。如:\u2026找啊找啊,终于找到了金矿","另见ā;á;ǎ;à;","\u201c阿\u201d另见ā;ǎ;à;ē"]},{"id":"50c3c31ebc297ff2","zi":"嗄","py":"a,sha","wubi":"kdht","pinyin":"á,shà","bushou":"口","bihua":"13","jijie":["嗄","shà","嗓音嘶哑。","","嗄","á","同\u201c啊2\u201d。","","笔画数：13；","部首：口；","笔顺编号：2511325111354",""],"xiangjie":["嗄","shà","【形】","声音嘶哑的〖hoarse〗","终日嚎而嗌不嗄。\u2014\u2014《老子》","又如:嗄哑,嗄嘶(嗓音嘶哑)","","嗄","shà","【叹】","什么〖what〗\u2014\u2014表示否定","我要丢个干干净,看你嗄法把我治。\u2014\u2014清·蒲松龄《聊斋俚曲集》","旧时仆役对主人、下级对上级的应诺声〖yes〗","\u201c带进来\u201d。两边军士应一声\u201c嗄\u201d,即将牛皋推至面前。\u2014\u2014《说岳全传》","另见á","","嗄","á","【叹】","同\u201c啊\u201d(á)。表示省悟或惊奇〖ah〗","嗄!难道这里是没有地方官的么?\u2014\u2014宋·佚名《新编五代史平话》","另见shà"]},{"id":"71f5862af09e60aa","zi":"腌","py":"a,yan","wubi":"edjn","pinyin":"ā,yān","bushou":"月","bihua":"12","jijie":["腌","yān","用盐浸渍食物：腌肉。腌菜。腌制。腌渍。","","笔画数：12；","部首：月；","笔顺编号：351113425115",""],"xiangjie":["腌","醃","yān","【动】","(形声。从肉,奄声。本义:用盐浸渍食物)","同本义〖salt〗","腌,渍肉也。\u2014\u2014《说文》","腌,酢,淹肉也。字亦作醃。\u2014\u2014《苍颉篇》","又如:腌腊肉;腌陈(盐渍久贮的食物);腌肉(指用盐浸渍肉块);腌胙(盐腌的胙肉);腌造(用盐或酱等浸渍加工鱼肉蔬菜瓜果等);腌菜(用盐浸渍的蔬菜);腌藏(腌渍储藏);腌腊(把鱼、肉等用盐浸渍,然后风干、熏干。亦指腌制后风干的鱼、肉、鸡、鸭等)","变咪〖gobad〗","兄长,已定这鱼腌了,不中仁兄吃。\u2014\u2014《水浒传》","另见ā","","腌货","yānhuò","〖preserveinsalt;pickledvegetable;saltedmeat〗用盐、糖、酱、酒等浸渍加工制成的咸肉、酱菜等","腌制","yānzhì","〖preserveinsalt〗用糖、盐等浸渍的方法制","腌制泡菜","腌渍","yānzì","〖pickle;salt〗腌","腌渍蔬菜","","腌","ā","另见yān","","腌臜","āzā","〖dirty〗[方言]∶脏的,不干净的","〖clumsy〗∶〖心里〗别扭;不痛快","晚到一步,事没办成,腌臜极了","〖nauseating〗∶骂人的话,混蛋无赖","腌臜泼才","",""]},{"id":"cf5f5aeed0a95c36","zi":"锕","py":"a","wubi":"qbsk","pinyin":"ā","bushou":"钅","bihua":"12","jijie":["锕","（錒）","ā","一种放射性元素，由铀衰变而成。","Acactinium","","笔画数：12；","部首：钅；","笔顺编号：311155212512",""],"xiangjie":["锕","錒","ā","【名】","一种放射性的三价金属元素,原子序数89,其化学性质类似于镧,由镤经放射α粒子生成,半衰期为22年,尤见于沥青铀矿中〖actinium〗\u2014\u2014元素符号Ac","",""]},{"id":"065f42a0e92d8b17","zi":"錒","py":"a","wubi":"","pinyin":"ā","bushou":"釒","bihua":"15","jijie":["錒","ā","见\u201c锕\u201d。","","笔画数：15；","部首：釒；","笔顺编号：341124315212512"],"xiangjie":[""]}]
         * page : 1
         * pagesize : 10
         * totalpage : 1
         * totalcount : 8
         */

        private int page;
        private int pagesize;
        private int totalpage;
        private int totalcount;
        private List<ListBean> list;

        public int getPage() {
            return page;
        }

        public void setPage(int page) {
            this.page = page;
        }

        public int getPagesize() {
            return pagesize;
        }

        public void setPagesize(int pagesize) {
            this.pagesize = pagesize;
        }

        public int getTotalpage() {
            return totalpage;
        }

        public void setTotalpage(int totalpage) {
            this.totalpage = totalpage;
        }

        public int getTotalcount() {
            return totalcount;
        }

        public void setTotalcount(int totalcount) {
            this.totalcount = totalcount;
        }

        public List<ListBean> getList() {
            return list;
        }

        public void setList(List<ListBean> list) {
            this.list = list;
        }

        public static class ListBean implements Serializable{
            /**
             * id : d3874a5d247665aa
             * zi : 阿
             * py : a,e
             * wubi : bskg
             * pinyin : à,ǎ,ā,ē
             * bushou : 阝
             * bihua : 7
             * jijie : ["阿","ā","加在称呼上的词头：阿大。阿爷。阿爹。阿罗汉。阿毛。阿婆。阿弟。阿姊。","","笔画数：7；","部首：阝；","笔顺编号：5212512",""]
             * xiangjie : ["阿","ē","【名】","(形声。从阜,可声。本义:大的山陵,大的土山)","同本义〖bigmound〗","阿,大陵也。一曰曲阜也。\u2014\u2014《说文》","我陵我阿。\u2014\u2014《诗·大雅·皇矣》","有卷者阿。\u2014\u2014《诗·大雅·卷阿》","在彼中阿。\u2014\u2014《诗·小雅·菁菁者莪》","又如:阿丘(一边偏高的土丘)","泛指山〖mountain〗","流自眺夫衡阿兮。\u2014\u2014张衡《思玄赋》。注:\u201c山下也。\u201d","又如:阿阜(山峰,峰峦);崇阿(高大的山)","山坡〖hillside〗","细缯,古代一种轻细的丝织品〖finesilks〗","衣阿锡,曳齐纨。\u2014\u2014《淮南子·修务》","被阿锡,揄纻缟。\u2014\u2014《史记·司马相如传》","曳阿锡。\u2014\u2014《汉书·礼乐志》。注:\u201c细缯也。\u201d","又如:阿锡(细的丝布。阿指细缯,锡是细布)","曲隅,角落〖corner〗","四阿重屋。\u2014\u2014《周礼·考工记》","若有人兮山之阿。\u2014\u2014《楚辞·山鬼》。注:\u201c曲隅也。\u201d","周阿而生\u2014\u2014班固《西都赋》。注:\u201c庭之曲也。\u201d","汾之阿。\u2014\u2014《汉书·礼乐志》。注:\u201c水之曲隅。\u201d","水边〖waterside〗","丙午,天子饮于河水之阿。\u2014\u2014《穆天子传》","近旁〖nearby;near〗。如:阿门(旁门)","地名。即今山东省东阿县〖Dong'ecounty〗。如:阿缟(古代齐国东阿县所产的细缯)","","阿","ē","【动】","曲从;迎合〖panderto;playupto〗","弗谏而阿之。\u2014\u2014《国语·周语》。注:\u201c随也。\u201d","阿郑君之心。\u2014\u2014《吕氏春秋·长见》","行叩诚而不阿兮。\u2014\u2014《楚辞·逢纷》。注:\u201c曲也。\u201d","是察阿党。\u2014\u2014《礼记·月令》。注:\u201c谓治狱吏以私恩,曲桡为也。\u201d","又如:阿奉(阿谀奉承);阿世(迎合世俗);阿邑(迎合奉承的样子);阿意(曲意附和他人的心意)","偏袒〖beunfairlypartialto〗。如:阿好(偏袒自己所喜好的人或事物);阿私(偏袒;庇护);阿党(结党偏私)","[方言]∶通\u201c屙\u201d。拉,排泄大小便〖exerete〗。如:阿金溺银(指生财有道);阿绵花屎(拖延,磨时间)","另见ā;ǎ;à;a","","阿堵","ēdǔ","〖money〗俗指银钱","任是亲儿女,还随阿堵移。\u2014\u2014《二刻拍案惊奇》","阿堵物","ēdǔwù","〖money〗钱","夷甫晨起,见钱阂行,呼婢曰:\u201c举却阿堵物。\u201d\u2014\u2014《世说新语·规箴》","阿附","ēfù","〖fawnonandecho〗逢迎依附","丞相匡衡、御史大夫张谭皆阿附畏事显,不敢言。\u2014\u2014《汉书·王尊传》","阿胶","ējiāo","〖EjiaodonkeyhideglueproducedinDongexianofShandongprovince〗中药名。别名驴皮胶。为驴皮加水熬成的胶","阿弥陀佛","ēmítuófó","〖梵Amitabha〗∶佛教徒所指西方极乐世界里最大的佛,为梵语Amitabha的译音,也译作无量寿佛或无量光明佛。净土宗以阿弥陀佛为西方极乐世界的教主,认为凡愿往生极乐净土者,念阿弥陀佛的名号,临终时佛即出现,引导其进入极乐国土","〖mayBuddhapreserveus;mercifulBuddha〗∶信佛的人口头念诵的用语。表示祈祷或感谢神灵等意思","〖thankGod!〗∶感叹用语,含有\u201c还好\u201d、\u201c万幸\u201d、\u201c谢天谢地\u201d一类的意思","没有人要你劝,少给我滋些事就阿弥陀佛了!\u2014\u2014沙汀《淘金记》","〖kind〗∶慈善的,善良的","这么个威武大汉,倒有一副阿弥陀佛的性子。\u2014\u2014蒋子龙《机电局长的一天》","阿房宫","eｐáｎｇgōｎｇ","［EpangPalace］秦始皇时开始建筑的大型宫殿,规模宏大。公元前212年动工,秦亡时未完工。项羽打进咸阳后被焚毁,遗址在今西安市西阿房村","蜀山兀，阿房出。\u2014\u2014杜枚《阿房宫赋》","阿房宫，三百里，住不下金陵一个史。\u2014\u2014《红楼梦》","阿其所好","ēqísuǒhào","〖pandertosb.\u2019swhims〗迎合别人的喜爱","吾何能阿其所好为?\u2014\u2014鲁迅《坟·摩罗诗力说》","阿谀","ēyú","〖flatter;toady〗说别人爱听的话迎合奉承","吾生为袁氏臣,死为袁氏鬼。不似汝辈谄阿谀之贼。\u2014\u2014《三国演义》","阿谀曲从","老练的阿谀可以买动一个老实人","","阿","ā","【助】","(汉语名词词头,盛行于魏晋以后)","加在亲属称呼前面有亲昵的意味","阿姊闻妹来。\u2014\u2014《乐府诗集·木兰诗》","府吏得闻之,堂上启阿母。\u2014\u2014《玉台新咏·古诗为焦仲卿妻作》。　","又如:阿爷(又作\u201c阿耶\u201d。称父亲);阿翁(称祖父;称父亲;妇女称丈夫之父);阿嫂(对朋友之妻的称呼);阿叔(对丈夫之弟的称呼);阿家(又称\u201c阿姑\u201d。妇人称丈夫的母亲);阿爹(称父亲;也尊称长者);阿父(称父亲;也称伯伯、叔叔,或作伯叔自称);阿伯(尊称年长的男子)","加于某些人的姓、名、小名、排行前用作称呼,往往带有一定的感情色彩或尊卑关系","阿女含泪答。\u2014\u2014《玉台新咏·古诗为焦仲卿妻作》。","又如:阿咸(侄子。晋朝阮籍的侄儿阮咸有才,后来遂用来称侄子);阿连(弟弟。南朝宋谢灵运的族弟惠连很有才,人们随谢灵运称之为阿连);阿杜(原指周盘龙的小妾杜氏,后为妾的别称);阿娇(汉武帝陈皇后的小名;泛指美丽的女子);阿蒙(三国时吴国名将吕蒙);阿瞒(三国曹操的小字)","","阿","ā","用于外国语的音译。如:阿根廷;阿拉伯;阿波罗","阿托(10-18)的简称〖atto-〗","阿","ā","【语气】","表示疑问、肯定、呼召、祈请等语气〖sameas\u201c啊\u201d〗","是阿!我想办一桩事情,总得先立个威。\u2014\u2014《文明小史》","好苦恼阿!好苦恼阿!我出去,我出去。\u2014\u2014佚名《刘弘嫁婢》","儿阿,不是我有心要耽误你。\u2014\u2014《儒林外史》","又如:阿也(阿约,阿呀。哎哟)","另见ǎ;à;a;ē;ě","","阿爸","ābà","〖father〗爸爸","阿鼻","ābí","〖梵语Avici〗音译名。意译为\u201c无间\u201d,即痛苦无有间断之意。为佛教八大地狱中最下、最苦之处","阿波罗计划","ābōluóJìhuà","〖Apolloprogram〗美国的一项科学技术计划,包括把人送上月球并安全返回地球","阿昌族","āchāngzú","〖theAchangnationality〗居住在云南省西南部陇川、梁河和临近的潞西、龙陵等县的一个少数民族","阿的平","ādìpíng","〖atabrine〗〖药〗黄色苦味粉末,2-甲氧-6-氯-9-(α-甲基-δ-二乙基胺-丁基)-氨吖啶的二盐酸盐。曾广泛用于预防和治疗疟疾,现已被氯喹取代","阿弟","ādì","〖theyoungerbrother〗∶弟弟","〖youngman〗∶年长者对年青人的客套称呼","阿斗","ādǒu","〖Adou〗∶三国蜀汉刘备之子刘禅的小名。此人庸碌无能,虽有诸葛亮等人全力扶助,也不能振兴蜀汉","〖anignorantandincapableman;good-for-nothingfellow〗∶后指懦弱无能的人","不要把群众看作阿斗","阿飞","āfēi","〖Teddyboy;beatnik;hippie(hippy);ayouthgiventorowdybehaviourandqueerdress〗穿着奇特服装、行为轻薄的青少年流氓","阿芙蓉","āfúróng","〖opium〗鸦片,俗称大烟。见\u201c阿片\u201d","阿芙蓉,芙前代罕闻,近方有用者,云是罂粟花之津液也。又,以花色似芙蓉而得名。\u2014\u2014李时珍《本草纲目》","阿哥","āgē","〖elderbrother〗∶对兄长的称呼","〖brother〗∶对年轻男子的亲热称呼\u2014\u2014尤其是某些少数民族地区年轻未婚女子对自己异性朋友的称呼","〖son〗∶满族父母对儿子的称呼","〖youngprince〗∶清代皇室称没有成年的皇子","阿公","āgōng","[方言]","〖father-in-law〗∶丈夫的父亲","〖grandfather〗∶祖父","〖oldgentleman〗∶对老年男人的尊称","〖papa〗∶爸爸","阿公要煮咸,阿妈要煮淡","阿訇","āhōng","〖ahung;Akhun;Imam;Mulla〗主持伊斯兰教的各种仪式,讲解古兰经的人","阿拉伯胶","ālābójiāo","〖gumarabic〗一种水溶性的胶,从几种金合欢属植物(尤指Acaciasenegal阿拉伯胶树和A.arabica阿拉伯金合欢)中得到,特别用于制造粘合剂、墨水和糖果,用于纺织品的精加工和制药","阿拉伯数字","ālābóshùzì","〖Arabicnumeral(figures)〗0、1、2、3、4、5、6、7、8、9这十个数字符号,是为了计数和算术运算而采用的约定写法,是国际通用的数码,也称为阿拉伯数码","阿罗汉","āluóhàn","〖Arhat〗〖佛教用语〗∶梵语的音译,即得道者、圣者的意思。小乘佛教所理想的最高果位,佛果;也是对断绝了一切嗜好情欲、解脱了烦恼、受人崇拜敬仰的圣人的一种称呼。又叫\u201c罗汉\u201d","阿罗汉诺矩罗居震旦东南大海际雁荡山芙蓉峰龙湫。\u2014\u2014宋·沈括《梦溪笔谈》","阿妈","āmā","〖ma,mother〗∶妈妈","〖servingwoman;amah〗∶女佣人","〖wife〗∶老年男子对妻子的称呼","〖father〗∶满族人称父亲,也作\u201c啊嘛\u201d","阿妹","āmèi","〖youngersister〗妹妹","阿门","āmēn","〖amen〗亦作\u201c阿们\u201d,希伯来语〖āmēn〗的译音,意为\u201c真诚\u201d,表示\u201c诚心所愿,心愿如此,但愿如此\u201d\u2014\u2014基督教徒祈祷完毕时的用语","阿米巴痢疾","āmǐbālìji","〖amoebicdysentery〗因阿米巴(溶组织性内阿米巴Endamoebahistolytica)感染引起的人类急性肠炎,特征为频繁排出充满粘液和血的稀便、肠绞痛以及或多或少的肠壁(尤其是结肠)糜烂","阿木林","āmùlín","〖dullfellow〗[方言]∶呆子;傻瓜","阿奶","ā\u2019nǎi","〖granny〗[方言]","奶奶","对年老妇女的通称","阿片","āpiàn","〖opium〗一种乳状液体,取自尚未成熟的罂粟果,干燥后呈淡黄色或棕色,味苦。有止泻、镇痛和止咳作用。又叫大烟、鸦片(雅片)或阿芙蓉","阿婆","āpó","〖grandmother〗∶祖母。敬称老年妇人","〖mother-in-law〗∶称丈夫的母亲","阿Ｑ","ā-Q","〖Ah-Q〗鲁迅小说《阿Q正传》中的主人公,精神胜利者的典型","阿司匹林","āsīpǐlín","〖aspirin〗一种白色结晶状的水杨酸化合物CH3COOC6H4COOH,主要用于解热镇痛","阿嚏","ātì","〖achi;sneeze〗象声词,打喷嚏的声音","阿托品","ātuōpǐn","〖atropine〗从颠茄和其他茄科植物提取出的一种有毒的白色结晶状生物碱C17H23NO3,主要用其硫酸盐解除痉挛,减少分泌,缓解疼痛,散大瞳孔","阿物儿","āwùr","〖something〗东西,常用做蔑称或对人开玩笑的称呼","你是什么阿物儿,跑来胡闹。\u2014\u2014《红楼梦》","阿兄","āxiōng","〖theelderbrother〗哥哥","阿姨","āyí","〖aunt〗[方言]∶母亲的姊妹","〖stepmother〗∶继母","〖auntie〗∶晚辈对任何女性长辈的亲切称呼","弟走从军阿姨死。\u2014\u2014白居易《琵琶行(并序)》","〖nurse〗∶照顾孩子的保姆","","阿","ǎ","【叹】","用于表示各种感情(如惊讶)〖ah〗","阿,你怎的这样客气起来!\u2014\u2014鲁迅《呐喊·故乡》","另见ā;à;a;ē;ě","","阿","à","【副】","[方言]∶可,是否〖may;can;whetherornot〗。用在问句中,加强语气。如:阿晓得(可晓得)?阿去(可去)?"]
             */

            private String id;
            private String zi;
            private String py;
            private String wubi;
            private String pinyin;
            private String bushou;
            private String bihua;
            private List<String> jijie;
            private List<String> xiangjie;

            public String getId() {
                return id;
            }

            public void setId(String id) {
                this.id = id;
            }

            public String getZi() {
                return zi;
            }

            public void setZi(String zi) {
                this.zi = zi;
            }

            public String getPy() {
                return py;
            }

            public void setPy(String py) {
                this.py = py;
            }

            public String getWubi() {
                return wubi;
            }

            public void setWubi(String wubi) {
                this.wubi = wubi;
            }

            public String getPinyin() {
                return pinyin;
            }

            public void setPinyin(String pinyin) {
                this.pinyin = pinyin;
            }

            public String getBushou() {
                return bushou;
            }

            public void setBushou(String bushou) {
                this.bushou = bushou;
            }

            public String getBihua() {
                return bihua;
            }

            public void setBihua(String bihua) {
                this.bihua = bihua;
            }

            public List<String> getJijie() {
                return jijie;
            }

            public void setJijie(List<String> jijie) {
                this.jijie = jijie;
            }

            public List<String> getXiangjie() {
                return xiangjie;
            }

            public void setXiangjie(List<String> xiangjie) {
                this.xiangjie = xiangjie;
            }
        }
    }
}
